#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: ToDo
#+DATE: <2021-01-12 Вт>
#+AUTHOR:
#+EMAIL: mnasoft@gmail.com
#+LANGUAGE: ru
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.3 (Org mode 9.1.9)
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)
#+LATEX_HEADER:

* Извлечение типов объектов их tetin-файла
Извлечение типов объектов их tetin-файла
#+BEGIN_SRC lisp
  (in-package :mnas-icem)
  (defun tetin-types ()
    (sort 
     (remove-duplicates
      (reduce #'(lambda (lst el)
		  (if (and (stringp el)
			   (< 0 (length el))
			   (alpha-char-p (first (coerce el 'list))))
		      (cons (first (mnas-string:split " " el)) lst)
		      lst))
	      ,*lines* :initial-value nil)
      :test #'equal)
     #'string<))

  (mapcar #'list (tetin-types))
#+END_SRC

#+RESULTS:
| affix                           |
| bspline                         |
| coedge                          |
| define_curve                    |
| define_family                   |
| define_model                    |
| define_prism_meshing_parameters |
| define_solid                    |
| define_subset                   |
| define_surface                  |
| loop                            |
| material_point                  |
| polyline                        |
| prescribed_point                |
| return                          |
| set_triangulation_tolerance     |
| trim_surface                    |

#+BEGIN_SRC lisp
(defun lam (el lst)
	    (when (alpha-char-p (first (coerce el 'list)))
	      (cons (first (mnas-string:split " " el)) lst)))
#+END_SRC


